Revit 2026 API

# CeramicCeramicBumpAmount Property

---

The property labeled "Amount" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property CeramicBumpAmount As String
	Get
```
```cpp
public:
static property String^ CeramicBumpAmount {
	String^ get ();
}
```
```fsharp
static member CeramicBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace